Repository: AmandoP/calliope-workbook1-el
Catalog: omegat/project_save.tmx
Source language: de_de
Languages: el

source: (parts per million)Teilchen in Millionen
el: (parts per million)Σωματίδια ανά εκατομμύριο

source: 3 Orangen bereitlegen
el: 3 πορτοκάλια έτοιμα

source: Setze die unten stehenden Bilder der Backanleitung in die richtige Reihenfolge, indem du sie von 1-5 durchnummerierst.
el: Αριθμήστε τις παρακάτω εικόνες της συνταγής ψησίματος στη σωστή σειρά, γράφοντας τους αριθμούς 1-5.

source: Starte den Simulator und beschreibe, was im Simulator passiert.
el: Ξεκίνησε τον προσομοιωτή και περίγραψε τι συμβαίνει στον προσομοιωτή.

source: a) Bringe die einzelnen Schritte in die richtige Reihenfolge.
el: α) Βάλε τα μεμονωμένα βήματα στη σωστή σειρά.

source: Tipp: Tippe Dauerhaft in die Suche ein!Lasse eine Rakete auf der LED-Matrix steigen.
el: Συμβουλή: Πληκτρολόγησε Διαρκώς στη σειρά αναζήτησης! Άφησε ένα πύραυλο να ανέβει στη μήτρα LED.

source: b) Kreise den Schritt ein, der wiederholt wird.
el: β) Κύκλωσε το βήμα που επαναλαμβάνεται.

source: Verwende eine Variable um die Geschwindigkeit deiner Animation zu bestimmen und bequem anzupassen.
el: Χρησιμοποίησε μια μεταβλητή για να καθορίσεις την ταχύτητα της κίνησής σου και να την προσαρμόσεις εύκολα.

source: Du musst wie ein Trickfilmprofi in Einzelbildern denken.Bringe die Befehle in die richtige Reihenfolge undlasse einen Countdown von 3-2-1-0 anzeigen.
el: Πρέπει να σκέφτεσαι σαν ένας επαγγελματίας κινουμένων σχεδίων σε μεμονωμένα καρέ. Βάλε τις εντολές στη σωστή σειρά και εμφάνισε μια αντίστροφη μέτρηση 3-2-1-0.

source: A
el: Α

source: Abfragen(ein-/zweifach)
el: Ερωτήσεις(απλή/διπλή)

source: Abfragen(mehrfach)
el: Ερωτήσεις (πολλαπλές)

source: Alle 25 LEDs können rot leuchten.
el: Όλα τα 25 LED μπορούν να φωτίζονται κόκκινα.

source: Am besten funktioniert es, wenn du bekannte Symbole und Bezeichnungen verwendest.
el: Λειτουργεί καλύτερα αν χρησιμοποιείς γνωστά σύμβολα και ονοματολογία.

source: Andere Wiederholungen sind an eine Bedingung oder ein anderes Ereignis geknüpft.
el: Άλλες επαναλήψεις είναι δεμένες σε μια συνθήκη ή σε ένα άλλο γεγονός.

source: Anstecken und Luftqualität messen!
el: Συνδέστε τη συσκευή και μετρήστε την ποιότητα του αέρα!

source: Anweisungen
el: Οδηγίες

source: Auch die Farbe und Anordnung einiger Bauteile hat sich leicht geändert.
el: Το χρώμα και η διάταξη ορισμένων εξαρτημάτων άλλαξαν λίγο.

source: Auf dem Monitor ...
el: Στην οθόνη ...

source: Aus dem Lautsprecher ...
el: Από το ηχείο ...

source: Ausgabe
el: Έξοδος

source: Autorin und Autor:Franka FutterliebAmando PascottoJørn AlraunBegleitendes Zusatzmaterial inklusive Leitfäden für den Unterricht, Programmcodes und Lösungen können auf der Webseite aufgerufen werden: calliope.cc/schulen/arbeitsheft
el: Συγγραφέας και Συγγραφέας:Franka FutterliebAmando PascottoJørn AlraunΤο συνοδευτικό πρόσθετο υλικό, συμπεριλαμβανομένων των οδηγών διδασκαλίας, των κωδικών προγραμματισμού και των λύσεων, μπορεί να ανακτηθεί στον ιστότοπο: calliope.cc/schulen/arbeitsheft

source: B
el: Β

source: BASTELN
el: ΚΑΤΑΣΚΕΥΕΣ

source: Bausteine eines Computers
el: Τα στοιχεία ενός υπολογιστή

source: Beim Programmieren werden Algorithmen, die der Computer ausführen soll, in Programme übersetzt, die der Computer versteht.
el: Όταν προγραμματίζεις, μεταφράζεις τους αλγορίθμους που θέλεις ο υπολογιστής να εκτελέσει σε προγράμματα που ο υπολογιστής καταλαβαίνει.

source: Beim Start erscheint ein Herz auf der LED-Matrix.Lasse „Ich Berlin!“ über die LED-Matrix laufen.Lasse dauerhaft ein Herz auf der LED-Matrix blinken.
el: Όταν ξεκινάει, εμφανίζεται μια καρδιά στη μήτρα LED.Κάνε το "Εγώ αγαπώ το Βερολίνο!" να τρέχει στη μήτρα LED.Κάνε μια καρδιά να αναβοσβήνει συνεχώς στη μήτρα LED.

source: Beim Start erscheint ein Herz auf der LED-Matrix.Lasse „Ich liebe Berlin!“ über die LED-Matrix laufen.Lasse dauerhaft ein Herz auf der LED-Matrix blinken.Tipp: Tippe Dauerhaft in die Suche ein!Lasse eine Rakete auf der LED-Matrix steigen.Tipp: Jetzt musst du denken, wie ein Trickfilmprofi- in Einzelbildern!Bring die Programmblöcke in die richtige Reihenfolgeund lass einen Countdown von 3-2-1-0 anzeigen.a) Füge hinter jeder Zahl eine Pause ein.b) Verlängere die Pausen indem du den Wert der Millisekunden (MS) erhöhst.c) Speichere dein Programm unter dem Namen „Raketenstart“.
el: Κατά την εκκίνηση εμφανίζεται μια καρδιά στη μήτρα LED.Άφησε το "Αγαπώ το Βερολίνο!" να τρέχει στη μήτρα LED.Άφησε μια καρδιά να αναβοσβήνει συνεχώς στη μήτρα LED.Συμβουλή: Πληκτρολόγησε Συνεχώς στην αναζήτηση!Άφησε ένα πύραυλο να ανεβαίνει στη μήτρα LED.Συμβουλή: Τώρα πρέπει να σκεφτείς σαν ένας επαγγελματίας κινουμένων σχεδίων- σε μεμονωμένα καρέ!Βάλε τα μπλοκ προγραμματισμού στη σωστή σειράκαι εμφάνισε μια αντίστροφη μέτρηση 3-2-1-0.α) Πρόσθεσε μια Παύση μετά από κάθε αριθμό.β) Παράτεινε τις παύσες αυξάνοντας την τιμή των χιλιοδευτερολέπτων (MS).γ) Αποθήκευσε το πρόγραμμά σου με το όνομα "Εκκίνηση πυραύλου".

source: Benenne dein Programm und klicke auf “Herunterladen”.
el: Ονόμασε το πρόγραμμά σου και κάνε κλικ στο "Λήψη".

source: Benenne dein Programm und klicke auf „Herunterladen”.
el: Ονόμασε το πρόγραμμά σου και κάνε κλικ στο «Λήψη».

source: Betrachte deinen Calliope mini.
el: Κοίταξε το Calliope mini σου.

source: Bringe die einzelnen Schritte in die richtige Reihenfolge.Kreise die Schritte ein, die wiederholt werden.
el: Βάλε τα μεμονωμένα βήματα στη σωστή σειρά. Κύκλωσε τα βήματα που επαναλαμβάνονται.

source: C
el: Γ

source: CO2-Sensor
el: Αισθητήρας CO2

source: CODEN
el: ΚΩΔΙΚΑΣ

source: Calliope mini Bluetooth-Modus
el: Λειτουργία Bluetooth της Calliope mini

source: Dabei spielt die Reihenfolge der Anweisungen eine entscheidende Rolle.
el: Εδώ η σειρά των εντολών παίζει έναν πολύ σημαντικό ρόλο.

source: Dafür werden klare und detaillierte Anweisungen benötigt, die nacheinander ausgeführt werden.
el: Γι' αυτό χρειάζονται σαφείς και λεπτομερείς οδηγίες που εκτελείς ο ένας μετά τον άλλον.

source: Damit der Calliope mini deine Anweisungen versteht, müssen diese in der passenden Sprache geschrieben werden.
el: Για να καταλάβει το Calliope mini τις οδηγίες σου, πρέπει να γραφτούν στη σωστή γλώσσα.

source: Das Programm wird zunächst als .hex-Datei im Download-Ordner gespeichert.
el: Το πρόγραμμα αποθηκεύεται πρώτα ως αρχείο .hex στον φάκελο Λήψεις.

source: Dazu brauchst du eine Programmierumgebung - auch Editor genannt.Eine passende Programmierumgebung ist der Editor MakeCode.Du findest ihn unter folgender Internetadresse:
el: Για αυτό χρειάζεσαι ένα περιβάλλον προγραμματισμού - που λέγεται επίσης Editor.Ένα κατάλληλο περιβάλλον προγραμματισμού είναι ο Editor MakeCode.Τον βρίσκεις στην ακόλουθη διεύθυνση στο διαδίκτυο:

source: Dazu wird die Calliope mini App benötigt.
el: Για αυτό χρειάζεσαι την εφαρμογή Calliope mini.

source: Deine bearbeiteten Projekte findest du auf der Startseite unter „Meine Projekte“.
el: Τα έργα που έχεις επεξεργαστεί τα βρίσκεις στην αρχική σελίδα κάτω από „Τα έργα μου".

source: Den Calliope mini steuern
el: Τον Calliope mini να ελέγχεις

source: Den Inhalt des Rucksacks kannst du ändern und über den Namen des Rucksacks abfragen.
el: Μπορείς να αλλάξεις το περιεχόμενο του σακιδίου και να το ρωτήσεις μέσω του ονόματος του σακιδίου.

source: Der Calliope mini
el: Το Calliope mini

source: Der Calliope mini kann mobil per Bluetooth programmiert werden.
el: Το Calliope mini μπορεί να προγραμματιστεί κινητά μέσω Bluetooth.

source: Der Computer ...
el: Ο υπολογιστής ...

source: Der Computer benötigt diese klaren, eindeutigen Anweisungen.
el: Ο υπολογιστής χρειάζεται αυτές τις σαφείς, ξεκάθαρες οδηγίες.

source: Der Programmbereich kann auch als Bühne angesehen werden, hier entwickelst du dein Programm, in dem du die einzelnen Programmblöcke platzierst.
el: Η περιοχή του προγράμματος μπορεί να θεωρηθεί και ως σκηνή, εδώ δημιουργείς το πρόγραμμά σου, τοποθετώντας τα επιμέρους μπλοκ προγράμματος.

source: Die .hex Datei lässt sich wieder in MakeCode öffnen und bearbeiten.
el: Το αρχείο .hex μπορεί να ανοιχθεί ξανά στο MakeCode και να επεξεργαστεί.

source: Die LED-Matrix ist der Bildschirm des Calliope mini.
el: Η μήτρα LED είναι η οθόνη του Calliope mini.

source: Die Sammlung dieser Handlungsanweisungen wird Programm oder Algorithmus genannt.In deinem Alltag gibt es viele Abläufe, die du hintereinander ausführst und bei denen du auf die Reihenfolge achten musst.
el: Η συλλογή αυτών των οδηγιών ενεργειών ονομάζεται πρόγραμμα ή αλγόριθμος. Στην καθημερινή σου ζωή υπάρχουν πολλές διαδικασίες που εκτελείς τη μία μετά την άλλη και πρέπει να προσέχεις τη σειρά τους.

source: Display, Hacken, Coden – was bedeutet das überhaupt?Wir haben eine Webseite mit den am häufigsten benutzten Begriffen zusammengetragen: https://calliope.cc/begriffe
el: Εμφάνιση, Χάκινγκ, Κωδικοποίηση – τι σημαίνει όλα αυτά;Συγκεντρώσαμε μια ιστοσελίδα με τους πιο συχνά χρησιμοποιούμενους όρους:https://calliope.cc/begriffe

source: Dort steht rechts neben dem USB-Anschluss die Versionsnummer.
el: Εκεί γράφει δεξιά δίπλα στη σύνδεση USB ο αριθμός έκδοσης.

source: Drücke die weiße Reset Taste auf deinem Calliope mini, um dein Programm auszuführen.
el: Πάτησε το λευκό κουμπί Reset στο Calliope mini σου για να εκτελέσεις το πρόγραμμά σου.

source: Drücke die weiße Reset Taste auf deinem Calliope mini, um dein Programm erneut zu starten.
el: Πάτησε το λευκό κουμπί Reset στο Calliope mini σου, για να ξεκινήσει ξανά το πρόγραμμά σου.

source: Drücke zusätzlich die Reset Taste für1 Sekunde.
el: Πάτησε επιπλέον το κουμπί Reset για1 δευτερόλεπτο.

source: Du kannst die Projekte im Arbeitsheft mit allen Calliope mini Versionen umsetzen.
el: Μπορείς να υλοποιήσεις τα έργα στο τετράδιο εργασίας με όλες τις εκδόσεις Calliope mini.

source: Du kannst diesen Link speichern oder mit anderen teilen.
el: Μπορείς να αποθηκεύσεις αυτόν τον σύνδεσμο ή να τον μοιραστείς με άλλους.

source: Du kannst ein Programm mit einem Rezept vergleichen.
el: Μπορείς να συγκρίνεις ένα πρόγραμμα με μια συνταγή.

source: Du kannst jederzeit die Version anpassen.
el: Μπορείς να προσαρμόσεις τη έκδοση ανά πάσα στιγμή.

source: Du möchtest ein leckeres Marmeladenbrot zum Frühstück?Bringe die Anweisungen in die richtige Reihenfolge.
el: Θέλεις ένα νόστιμο ψωμί με μαρμελάδα για το πρωινό; Βάλε τις οδηγίες στη σωστή σειρά.

source: Durch einen Klick auf das Speichern-Symbolkannst du dein Programm als .hex Datei speichern.
el: Κάνοντας κλικ στο σύμβολο Αποθήκευσημπορείς να αποθηκεύσεις το πρόγραμμά σου ως αρχείο .hex.

source: Ein Algorithmus ist eine Verarbeitungsvorschrift mit eindeutig ausführbaren Anweisungen.
el: Ένας αλγόριθμος είναι μια οδηγία επεξεργασίας με σαφείς εντολές που μπορείς να εκτελέσεις.

source: Ein Computersystem besteht aus vielen Bauteilen, kennst du sie?Einige dieser Bauteile sind auch auf dem Calliope mini zu finden.
el: Ένα σύστημα υπολογιστή αποτελείται από πολλά εξαρτήματα, τα γνωρίζεις;Μερικά από αυτά τα εξαρτήματα βρίσκονται και στο Calliope mini.

source: Ein Plan hilft dir bei der Umsetzung deiner Idee und ist nützlich, damit du den Überblick bewahrst.
el: Ένα σχέδιο σε βοηθά να υλοποιήσεις την ιδέα σου και είναι χρήσιμο για να κρατήσεις τα πάντα σε τάξη.

source: Ein neues Projekt startenKlicke auf die türkise Schaltfläche mit dem großen „+“ Zeichen.
el: Ξεκίνησε ένα νέο έργοΚάνε κλικ στο τιρκουάζ κουμπί με το μεγάλο σύμβολο „+".

source: Eine Variable ist wie ein Rucksack mit Namensschild, den du immer dabei hast und der jederzeit den Inhalt bereithält.
el: Μια μεταβλητή είναι σαν ένα σακίδιο με ετικέτα ονόματος, που πάντα έχεις μαζί σου και που έχει πάντα το περιεχόμενό του έτοιμο.

source: Einfach anschließen und den CO2 Gehalt, die Temperatur und die Luftfeuchtigkeit messen.
el: Απλώς συνδέστε και μέτρησε το περιεχόμενο CO2, τη θερμοκρασία και την υγρασία του αέρα.

source: Eingabe
el: Εισαγωγή

source: Ergänze das Struktogramm um zwei Entscheidungen und formuliere passende Anweisungen.
el: Συμπλήρωσε το διάγραμμα δομής με δύο αποφάσεις και διατύπωσε κατάλληλες οδηγίες.

source: Ergänze das Struktogramm und füge die einzelnen Schritte in der richtigen Reihenfolge des Saftmachens hinzu.• Hälften auspressen• 3 Mal wiederholen• Orange in der Mitte durchschneiden
el: Συμπλήρωσε το διάγραμμα και πρόσθεσε τα επιμέρους βήματα στη σωστή σειρά για να φτιάξεις χυμό. • Πιέστε τις μισές πορτοκάλια • Επανάλαβε 3 φορές • Κόψε το πορτοκάλι στη μέση

source: Erstelle das abgebildete Programm.
el: Δημιούργησε το πρόγραμμα που φαίνεται στην εικόνα.

source: Erstelle dazu folgende Programme in MakeCode.
el: Δημιούργησε τα ακόλουθα προγράμματα στο MakeCode.

source: Erstelle dazu folgende Programme in MakeCode.Starte den Simulator und beschreibe, was im Simulator passiert.
el: Δημιούργησε τα ακόλουθα προγράμματα στο MakeCode.Ξεκίνησε τον προσομοιωτή και περίγραψε τι συμβαίνει στον προσομοιωτή.

source: Erstelle ein eigenes Struktogramm für das Überqueren einer Straße.Verwende folgende Beschreibungen der einzelnen Schritte.• Ich gehe zur Ampel.• Ich überprüfe das Ampelsignal.• Ist das Signal der Ampel grün?• Ich überquere die Straße.• Ich bleibe stehen.
el: Δημιούργησε το δικό σου δομόγραμμα για να διασχίσεις έναν δρόμο. Χρησιμοποίησε τις ακόλουθες περιγραφές των επιμέρους βημάτων. • Πηγαίνω στο φανάρι. • Ελέγχω το σήμα του φαναριού. • Είναι το σήμα του φαναριού πράσινο; • Διασχίζω τον δρόμο. • Μένω στη θέση μου.

source: Erstelle folgende Programme in MakeCode:
el: Δημιούργησε τα ακόλουθα προγράμματα στο MakeCode:

source: Es gibt Abläufe, die durch getroffene Entscheidungen unterschiedlich verlaufen.Verbinde die Bedingungen (wenn) mit der passenden Entscheidung (dann).
el: Υπάρχουν διαδικασίες που εξελίσσονται διαφορετικά ανάλογα με τις αποφάσεις που παίρνεις. Σύνδεσε τις συνθήκες (αν) με την κατάλληλη απόφαση (τότε).

source: Es lassen sich Texte, Symbole und sogar Animationen anzeigen.
el: Μπορείς να εμφανίσεις κείμενα, σύμβολα και ακόμη και κινούμενες εικόνες.

source: Formuliere fünf Anweisungen, die den Ablauf des Zähneputzens beschreiben.
el: 1. Βρες την οδοντόβουρτσά σου και βάλε λίγη οδοντόκρεμα πάνω της. 2. Βρέξε την οδοντόβουρτσά σου με νερό και αρχίστε να καθαρίζεις τα δόντια σου με κυκλικές κινήσεις. 3. Καθάρισε προσεκτικά όλα τα δόντια σου - πάνω, κάτω και στις πλευρές. 4. Ξεπλύνε το στόμα σου με νερό και φτύσε την οδοντόκρεμα. 5. Ξεπλύνε ξανά την οδοντόβουρτσά σου με νερό και άφησέ την να στεγνώσει.

source: Futter in den Napf füllen
el: Βάλε φαγητό στο μπολ

source: Führe die einzelnen Schritte in der richtigen Reihenfolge aus und teste auf deinem Calliope mini.
el: Εκτέλεσε τα επιμέρους βήματα με τη σωστή σειρά και δοκίμασε στο Calliope mini σου.

source: Führe die einzelnen Schritte in der richtigen Reihenfolge aus und teste sie auf deinem Calliope mini.
el: Εκτέλεσε τα επιμέρους βήματα με τη σωστή σειρά και δοκίμασέ τα στο Calliope mini σου.

source: Gehe schrittweise vor!
el: Πήγαινε βήμα-βήμα!

source: Geschrieben wird ...
el: Γράφεται ...

source: Gib die URL in die Browserleiste ein - makecode.calliope.cc
el: Πληκτρολόγησε τη διεύθυνση URL στη γραμμή του περιηγητή - makecode.calliope.cc

source: Hacken
el: Κόψιμο

source: Halte die Tasten A+B so lange gedrückt, bis dieBluetooth-Animation beendet ist.• Das individuelle ID-Muster erscheint auf deinem Calliope mini.• Ab dem Calliope mini 3 kannst du den Bluetooth-Modus starten,indem du 3x die Reset Taste drückst.
el: Κρατά τα κουμπιά A+B πατημένα μέχρι να τελειώσει η κίνηση του Bluetooth. • Το μοναδικό σου μοτίβο ID εμφανίζεται στο Calliope mini σου. • Από το Calliope mini 3 και πάνω, μπορείς να ξεκινήσεις τη λειτουργία Bluetooth πατώντας 3 φορές το κουμπί Reset.

source: Hardware auswählenWähle zu Beginn eines neuen Projekts deine Calliope mini Version aus.
el: Επιλογή υλικού Στην αρχή ενός νέου έργου, επίλεξε την έκδοση Calliope mini που έχεις.

source: Hier ist Platz für dein Struktogramm:
el: Εδώ είναι χώρος για το δικό σου δομόγραμμα:

source: Hier ist etwas durcheinander geraten.
el: Κάτι μπέρδεψε εδώ.

source: Hier kannst du dein Programm benennen, speichern und übertragen.
el: Εδώ μπορείς να ονομάσεις το πρόγραμμά σου, να το αποθηκεύσεις και να το μεταφέρεις.

source: Hier siehst du ein Struktogramm, das den Ablauf des Hundefütterns darstellt.Schau dir die einzelnen Anweisungen an und kreise die Entscheidung ein.
el: Εδώ βλέπεις ένα διάγραμμα ροής που δείχνει πώς ταΐζεις το σκυλάκι.Κοίταξε τις μεμονωμένες οδηγίες και κύκλωσε την απόφαση.

source: Hier siehst du eine Abbildung des Calliope mini.
el: Εδώ βλέπεις μια εικόνα του Calliope mini.

source: Hinweis: Ab dem Calliope mini 3 gibt es drei RGB-LEDs.
el: Σημείωση: Από το Calliope mini 3 και πέρα υπάρχουν τρία RGB-LED.

source: Hinweis: Stelle sicher, dass du deine Calliope mini Version im Simulator siehst.
el: Σημείωση: Βεβαιώσου ότι βλέπεις την έκδοση της Calliope mini σου στον προσομοιωτή.

source: Hoch hinaus! Hast du es gewusst: Der Calliope mini war zusammen mit dem ESA-Astronauten Matthias Maurer auf der internationalen Raumstation und hat dort fleißig Experimente ausgeführt.
el: Ψηλά ψηλά! Το ήξερες; Ο Calliope mini ήταν μαζί με τον αστροναύτη της ESA Matthias Maurer στο διεθνές διαστημικό σταθμό και εκεί έκανε επιμελώς πειράματα.

source: Hund frisst
el: Ο σκύλος τρώει

source: Ich beiße ein Stück der Banane ab.
el: Δαγκώνω ένα κομμάτι της μπανάνας.

source: Ich entferne die Schale.
el: Αφαιρώ το κέλυφος.

source: Ich gehe zur Tür.
el: Πηγαίνω στην πόρτα.

source: Ich gucke aus dem Fenster
el: Κοιτάζω έξω από το παράθυρο

source: Ich höre ein „Herein“.
el: Ακούω ένα «Μπες μέσα».

source: Ich kaue.
el: Μασώ.

source: Ich klopfe.
el: Χτυπώ.

source: Ich nehme die Banane.
el: Παίρνω τη μπανάνα.

source: Ich schlucke hinunter.
el: Καταπίνω.

source: Ich trete ein.
el: Μπαίνω.

source: Ich wiederhole drei Mal:
el: Επαναλαμβάνω τρεις φορές:

source: Ich wiederhole folgende drei Vorgänge, bis die Banane aufgegessen ist:
el: Επαναλαμβάνω τις ακόλουθες τρεις ενέργειες, μέχρι να φάω όλη τη μπανάνα:

source: Im Simulator kannst du die Programme direkt testen.
el: Στο προσομοιωτή μπορείς να δοκιμάσεις τα προγράμματα απευθείας.

source: Importiere die benötigten Programmblöcke:CO2-Sensor-SCD40
el: Εισάγαγε τα απαραίτητα μπλοκ προγράμματος:CO2-Sensor-SCD40

source: In der Bibliothek findest du alle Programmblöcke, die du für deine Anweisungen benötigst.
el: Στη βιβλιοθήκη θα βρεις όλα τα μπλοκ προγραμματισμού που χρειάζεσαι για τις οδηγίες σου.

source: Inhaltsverzeichnis
el: Περιεχόμενα

source: JA
el: Δεν υπάρχει κείμενο για μετάφραση. Παρακαλώ δώσε μου το γερμανικό κείμενο που θέλεις να μεταφράσω στα ελληνικά.

source: JETZT
el: ΤΩΡΑ

source: Je genauer die Anweisungen, desto präziser ist das Ergebnis.
el: Όσο πιο λεπτομερείς είναι οι οδηγίες, τόσο πιο ακριβές είναι το αποτέλεσμα.

source: KENNENLERNEN
el: ΓΝΩΡΙΜΙΑ

source: Kennenlernen
el: Γνωριμία

source: Kennst du die verschiedenen Bereiche des Editors und kannst sie den Beschreibungen zuordnen?
el: Γνωρίζεις τα διάφορα μέρη του προγράμματος και μπορείς να τα ταιριάξεις με τις περιγραφές;

source: Klicke dazu auf die drei Punkte neben „Herunterladen“ und drücke „Hardware auswählen“.
el: Κάνε κλικ στις τρεις τελείες δίπλα στο "Λήψη" και πάτησε "Επιλογή υλικού".

source: LED-Matrix
el: Μήτρα LED

source: LED-Matrix18RGB-LED21Knöpfe24Lautsprecher25Touch-Pins26Funken28
el: LED-Matrix18RGB-LED21Κουμπιά24Ηχείο25Pins Αφής26Ραδιοφωνία28

source: LOS
el: ΛΟΣ

source: LUFTQUALITÄT
el: ΠΟΙΟΤΗΤΑ ΤΟΥ ΑΕΡΑ

source: Lagesensor
el: Αισθητήρας θέσης

source: Lautsprecher
el: Ηχείο

source: Lerne den Calliope mini kennen.Entwickle kreative Ideen und produziere eigene Prototypen.
el: Γνώρισε το Calliope mini. Ανάπτυξε δημιουργικές ιδέες και φτιάξε τα δικά σου πρωτότυπα.

source: Lerne die einzelnen Aktoren und Sensoren des Calliope mini zu steuern und erstelle erste eigene Programme.
el: Μάθε να ελέγχεις τους μεμονωμένους ενεργοποιητές και αισθητήρες του Calliope mini και δημιούργησε τα πρώτα δικά σου προγράμματα.

source: Licht32Lautstärke34Temperatur37Lage40Orakel42Feuchtigkeitssensor44Pflanzenstation45Ultraschallsensor48Personenzähler50CO2-Sensor53Luftqualität54
el: Φως32Ένταση ήχου34Θερμοκρασία37Θέση40Μαντείο42Αισθητήρας υγρασίας44Σταθμός φυτών45Αισθητήρας υπερήχων48Μετρητής ατόμων50Αισθητήρας CO253Ποιότητα αέρα54

source: Lizenziert unter Creative Commons Namensnennung 4.0 InternationalCalliope gGmbH
el: Αδειοδοτημένο υπό Creative Commons Αναφορά 4.0 Διεθνές Calliope gGmbH

source: Luftqualität
el: Ποιότητα αέρα

source: Mache einen Plan.2) Setze dein Programm aus den einzelnen Programmblöcken zusammen.3) Überprüfe dein Programm im Simulator.4) Übertrage dein Programm auf den Calliope mini.5) Führe dein Programm auf dem Calliope mini aus.
el: Κάνε ένα σχέδιο.2) Συναρμολόγησε το πρόγραμμά σου από τα επιμέρους μπλοκ προγράμματος.3) Ελέγξε το πρόγραμμά σου στον προσομοιωτή.4) Μεταφέρ το πρόγραμμά σου στο Calliope mini.5) Εκτέλεσε το πρόγραμμά σου στο Calliope mini.

source: Mikrofon
el: Μικρόφωνο

source: Mit Hilfe der Sensoren kann der Calliope mini unterschiedlichste Werte aus der Umgebung messen.
el: Με τη βοήθεια των αισθητήρων, το Calliope mini μπορεί να μετρήσει πολλές διαφορετικές τιμές από το περιβάλλον.

source: Mit demGrove-Kabel wird der SCD40 über den Grove-Anschluss A0 mit dem Calliope mini verbunden.
el: Με το καλώδιο Grove συνδέεις τον SCD40 με το Calliope mini μέσω της θύρας Grove A0.

source: Mit der CO2-Platine lassen sich drei unterschiedliche Werte messen.
el: Με την πλακέτα CO2 μπορείς να μετρήσεις τρεις διαφορετικές τιμές.

source: Mit der Maus ...
el: Με το ποντίκι ...

source: NEIN
el: Όχι

source: Napfbereitstellen
el: Μπολ προετοιμασίας

source: Nur durch Testen und Ausprobieren, erfährst du welche Geschwindigkeit die richtige für dich ist.Programmier:innen sind sehr gerne bequem.Anstatt immer wieder in jedem Pause Befehl die Geschwindigkeit zu ändern, kannst dues dir viel einfacher machen.
el: Μόνο δοκιμάζοντας και πειραματιζόμενος, θα μάθεις ποια ταχύτητα είναι σωστή για σένα. Οι προγραμματιστές είναι πολύ τεμπέληδες. Αντί να αλλάζεις κάθε φορά την ταχύτητα σε κάθε εντολή παύσης, μπορείς να το κάνεις πολύ πιο εύκολα.

source: Oder scanne denQR-Code.
el: Ή σάρωσε τον κωδικό QR.

source: Ordne die Bauteile des Calliope mini den unterschiedlichen Kategorien Eingabe, Verarbeitung und Ausgabe zu, indem du sie mit Linien verbindest.
el: Κατέταξε τα εξαρτήματα του Calliope mini στις διαφορετικές κατηγορίες Είσοδος, Επεξεργασία και Έξοδος συνδέοντάς τα με γραμμές.

source: Ordne die Begriffe zu und schreibe sie an die Linien.Computer, Monitor, Tastatur, Maus, Lautsprecher
el: Αντιστοίχισε τις έννοιες και γράψε τις στις γραμμές. Υπολογιστής, Οθόνη, Πληκτρολόγιο, Ποντίκι, Ηχείο

source: Ordne die einzelnen Teile den Kategorien Eingabe (pink), Verarbeitung (grün) oder Ausgabe (türkis) zu, indem du sie mit der passenden Farbe einkreist.
el: Κατέταξε τα επιμέρους μέρη στις κατηγορίες Είσοδος (ροζ), Επεξεργασία (πράσινο) ή Έξοδος (τυρκουάζ) κυκλώνοντάς τα με το κατάλληλο χρώμα.

source: Programme übertragen
el: Μεταφόρτωση προγραμμάτων

source: Programmieren heißt, einem Computer (z.B. deinem Calliope mini) Schritt-für-Schritt zu sagen, was er tun soll.
el: Το προγραμματισμό σημαίνει να λες στον υπολογιστή σου (για παράδειγμα, το Calliope mini σου) βήμα-βήμα τι πρέπει να κάνει.

source: Programmierumgebung
el: Περιβάλλον Προγραμματισμού

source: Projekt benennenGib einen passenden Namen ein und klicke auf „Erstelle“.
el: Ονόμασε το έργο Δώσε ένα κατάλληλο όνομα και κάνε κλικ στο "Δημιουργία".

source: Prozessor
el: Επεξεργαστής

source: Raketenstart
el: Εκτόξευση Πυραύλου

source: Relative Humidityrelative Luftfeuchtigkeit
el: Relarive HumidityΣχετική Υγρασία

source: Saft in ein Glas gießen
el: Χύνε χυμό σε ένα ποτήρι
